Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_bf.h
/**
 * \file IfxPort_bf.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: MCMCAN_TC39x_MCSFR.xml dated 07.08.2014
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Port_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Port
 *
 */
#ifndef IFXPORT_BF_H
#define IFXPORT_BF_H                 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_BitfieldsMask
 * \{  */

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN0 */
#define IFX_P_ACCEN0_EN0_LEN         (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN0 */
#define IFX_P_ACCEN0_EN0_MSK         (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN0 */
#define IFX_P_ACCEN0_EN0_OFF         (0)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN10 */
#define IFX_P_ACCEN0_EN10_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN10 */
#define IFX_P_ACCEN0_EN10_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN10 */
#define IFX_P_ACCEN0_EN10_OFF        (10)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN11 */
#define IFX_P_ACCEN0_EN11_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN11 */
#define IFX_P_ACCEN0_EN11_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN11 */
#define IFX_P_ACCEN0_EN11_OFF        (11)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN12 */
#define IFX_P_ACCEN0_EN12_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN12 */
#define IFX_P_ACCEN0_EN12_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN12 */
#define IFX_P_ACCEN0_EN12_OFF        (12)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN13 */
#define IFX_P_ACCEN0_EN13_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN13 */
#define IFX_P_ACCEN0_EN13_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN13 */
#define IFX_P_ACCEN0_EN13_OFF        (13)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN14 */
#define IFX_P_ACCEN0_EN14_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN14 */
#define IFX_P_ACCEN0_EN14_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN14 */
#define IFX_P_ACCEN0_EN14_OFF        (14)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN15 */
#define IFX_P_ACCEN0_EN15_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN15 */
#define IFX_P_ACCEN0_EN15_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN15 */
#define IFX_P_ACCEN0_EN15_OFF        (15)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN16 */
#define IFX_P_ACCEN0_EN16_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN16 */
#define IFX_P_ACCEN0_EN16_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN16 */
#define IFX_P_ACCEN0_EN16_OFF        (16)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN17 */
#define IFX_P_ACCEN0_EN17_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN17 */
#define IFX_P_ACCEN0_EN17_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN17 */
#define IFX_P_ACCEN0_EN17_OFF        (17)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN18 */
#define IFX_P_ACCEN0_EN18_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN18 */
#define IFX_P_ACCEN0_EN18_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN18 */
#define IFX_P_ACCEN0_EN18_OFF        (18)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN19 */
#define IFX_P_ACCEN0_EN19_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN19 */
#define IFX_P_ACCEN0_EN19_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN19 */
#define IFX_P_ACCEN0_EN19_OFF        (19)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN1 */
#define IFX_P_ACCEN0_EN1_LEN         (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN1 */
#define IFX_P_ACCEN0_EN1_MSK         (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN1 */
#define IFX_P_ACCEN0_EN1_OFF         (1)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN20 */
#define IFX_P_ACCEN0_EN20_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN20 */
#define IFX_P_ACCEN0_EN20_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN20 */
#define IFX_P_ACCEN0_EN20_OFF        (20)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN21 */
#define IFX_P_ACCEN0_EN21_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN21 */
#define IFX_P_ACCEN0_EN21_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN21 */
#define IFX_P_ACCEN0_EN21_OFF        (21)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN22 */
#define IFX_P_ACCEN0_EN22_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN22 */
#define IFX_P_ACCEN0_EN22_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN22 */
#define IFX_P_ACCEN0_EN22_OFF        (22)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN23 */
#define IFX_P_ACCEN0_EN23_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN23 */
#define IFX_P_ACCEN0_EN23_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN23 */
#define IFX_P_ACCEN0_EN23_OFF        (23)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN24 */
#define IFX_P_ACCEN0_EN24_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN24 */
#define IFX_P_ACCEN0_EN24_MSK        (0x1)

/** \\brief  Offset for Ifx_P_ACCEN0_Bits.EN24 */
#define IFX_P_ACCEN0_EN24_OFF        (24)

/** \\brief  Length for Ifx_P_ACCEN0_Bits.EN25 */
#define IFX_P_ACCEN0_EN25_LEN        (1)

/** \\brief  Mask for Ifx_P_ACCEN0_Bits.EN25 */
#define IFX_P_ACCEN0_EN25_MSK        (0x1)

