Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_bf.h
/** \\brief  Length for Ifx_P_IN_Bits.P7 */
#define IFX_P_IN_P7_LEN              (1)

/** \\brief  Mask for Ifx_P_IN_Bits.P7 */
#define IFX_P_IN_P7_MSK              (0x1)

/** \\brief  Offset for Ifx_P_IN_Bits.P7 */
#define IFX_P_IN_P7_OFF              (7)

/** \\brief  Length for Ifx_P_IN_Bits.P8 */
#define IFX_P_IN_P8_LEN              (1)

/** \\brief  Mask for Ifx_P_IN_Bits.P8 */
#define IFX_P_IN_P8_MSK              (0x1)

/** \\brief  Offset for Ifx_P_IN_Bits.P8 */
#define IFX_P_IN_P8_OFF              (8)

/** \\brief  Length for Ifx_P_IN_Bits.P9 */
#define IFX_P_IN_P9_LEN              (1)

/** \\brief  Mask for Ifx_P_IN_Bits.P9 */
#define IFX_P_IN_P9_MSK              (0x1)

/** \\brief  Offset for Ifx_P_IN_Bits.P9 */
#define IFX_P_IN_P9_OFF              (9)

/** \\brief  Length for Ifx_P_IOCR0_Bits.PC0 */
#define IFX_P_IOCR0_PC0_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR0_Bits.PC0 */
#define IFX_P_IOCR0_PC0_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR0_Bits.PC0 */
#define IFX_P_IOCR0_PC0_OFF          (3)

/** \\brief  Length for Ifx_P_IOCR0_Bits.PC1 */
#define IFX_P_IOCR0_PC1_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR0_Bits.PC1 */
#define IFX_P_IOCR0_PC1_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR0_Bits.PC1 */
#define IFX_P_IOCR0_PC1_OFF          (11)

/** \\brief  Length for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_OFF          (19)

/** \\brief  Length for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_OFF          (27)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_LEN        (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_MSK        (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_OFF        (3)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_LEN        (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_MSK        (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_OFF        (11)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_LEN        (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_MSK        (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_OFF        (19)

/** \\brief  Length for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_LEN        (5)

/** \\brief  Mask for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_MSK        (0x1f)

/** \\brief  Offset for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_OFF        (27)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_OFF          (3)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_OFF          (11)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_OFF          (19)

/** \\brief  Length for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_OFF          (27)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_LEN         (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_MSK         (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_OFF         (19)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_LEN         (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_MSK         (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_OFF         (27)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_OFF          (3)

/** \\brief  Length for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_LEN          (5)

/** \\brief  Mask for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_MSK          (0x1f)

/** \\brief  Offset for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_OFF          (11)

/** \\brief  Length for Ifx_P_LPCR0_Bits.LRXTERM */
#define IFX_P_LPCR0_LRXTERM_LEN      (3)

/** \\brief  Mask for Ifx_P_LPCR0_Bits.LRXTERM */
#define IFX_P_LPCR0_LRXTERM_MSK      (0x7)

/** \\brief  Offset for Ifx_P_LPCR0_Bits.LRXTERM */
#define IFX_P_LPCR0_LRXTERM_OFF      (3)

/** \\brief  Length for Ifx_P_LPCR0_Bits.LVDSM */
#define IFX_P_LPCR0_LVDSM_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR0_Bits.LVDSM */
#define IFX_P_LPCR0_LVDSM_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR0_Bits.LVDSM */
#define IFX_P_LPCR0_LVDSM_OFF        (6)

/** \\brief  Length for Ifx_P_LPCR0_Bits.PS */
#define IFX_P_LPCR0_PS_LEN           (1)

/** \\brief  Mask for Ifx_P_LPCR0_Bits.PS */
#define IFX_P_LPCR0_PS_MSK           (0x1)

/** \\brief  Offset for Ifx_P_LPCR0_Bits.PS */
#define IFX_P_LPCR0_PS_OFF           (7)

/** \\brief  Length for Ifx_P_LPCR0_Bits.REN_CTRL */
#define IFX_P_LPCR0_REN_CTRL_LEN     (1)

