Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_bf.h
/** \\brief  Length for Ifx_P_LPCR1_Bits.TERM */
#define IFX_P_LPCR1_TERM_LEN         (1)

/** \\brief  Mask for Ifx_P_LPCR1_Bits.TERM */
#define IFX_P_LPCR1_TERM_MSK         (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_Bits.TERM */
#define IFX_P_LPCR1_TERM_OFF         (2)

/** \\brief  Length for Ifx_P_LPCR1_Bits.TX_EN */
#define IFX_P_LPCR1_TX_EN_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR1_Bits.TX_EN */
#define IFX_P_LPCR1_TX_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_Bits.TX_EN */
#define IFX_P_LPCR1_TX_EN_OFF        (9)

/** \\brief  Length for Ifx_P_LPCR1_Bits.TX_PD */
#define IFX_P_LPCR1_TX_PD_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR1_Bits.TX_PD */
#define IFX_P_LPCR1_TX_PD_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_Bits.TX_PD */
#define IFX_P_LPCR1_TX_PD_OFF        (14)

/** \\brief  Length for Ifx_P_LPCR1_Bits.TX_PWDPD */
#define IFX_P_LPCR1_TX_PWDPD_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR1_Bits.TX_PWDPD */
#define IFX_P_LPCR1_TX_PWDPD_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_Bits.TX_PWDPD */
#define IFX_P_LPCR1_TX_PWDPD_OFF     (15)

/** \\brief  Length for Ifx_P_LPCR1_Bits.VDIFFADJ */
#define IFX_P_LPCR1_VDIFFADJ_LEN     (2)

/** \\brief  Mask for Ifx_P_LPCR1_Bits.VDIFFADJ */
#define IFX_P_LPCR1_VDIFFADJ_MSK     (0x3)

/** \\brief  Offset for Ifx_P_LPCR1_Bits.VDIFFADJ */
#define IFX_P_LPCR1_VDIFFADJ_OFF     (10)

/** \\brief  Length for Ifx_P_LPCR1_Bits.VOSDYN */
#define IFX_P_LPCR1_VOSDYN_LEN       (1)

/** \\brief  Mask for Ifx_P_LPCR1_Bits.VOSDYN */
#define IFX_P_LPCR1_VOSDYN_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_Bits.VOSDYN */
#define IFX_P_LPCR1_VOSDYN_OFF       (12)

/** \\brief  Length for Ifx_P_LPCR1_Bits.VOSEXT */
#define IFX_P_LPCR1_VOSEXT_LEN       (1)

/** \\brief  Mask for Ifx_P_LPCR1_Bits.VOSEXT */
#define IFX_P_LPCR1_VOSEXT_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR1_Bits.VOSEXT */
#define IFX_P_LPCR1_VOSEXT_OFF       (13)

/** \\brief  Length for Ifx_P_LPCR2_Bits.LRXTERM */
#define IFX_P_LPCR2_LRXTERM_LEN      (3)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.LRXTERM */
#define IFX_P_LPCR2_LRXTERM_MSK      (0x7)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.LRXTERM */
#define IFX_P_LPCR2_LRXTERM_OFF      (3)

/** \\brief  Length for Ifx_P_LPCR2_Bits.LVDSM */
#define IFX_P_LPCR2_LVDSM_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.LVDSM */
#define IFX_P_LPCR2_LVDSM_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.LVDSM */
#define IFX_P_LPCR2_LVDSM_OFF        (6)

/** \\brief  Length for Ifx_P_LPCR2_Bits.PS */
#define IFX_P_LPCR2_PS_LEN           (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.PS */
#define IFX_P_LPCR2_PS_MSK           (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.PS */
#define IFX_P_LPCR2_PS_OFF           (7)

/** \\brief  Length for Ifx_P_LPCR2_Bits.REN_CTRL */
#define IFX_P_LPCR2_REN_CTRL_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.REN_CTRL */
#define IFX_P_LPCR2_REN_CTRL_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.REN_CTRL */
#define IFX_P_LPCR2_REN_CTRL_OFF     (0)

/** \\brief  Length for Ifx_P_LPCR2_Bits.RX_EN */
#define IFX_P_LPCR2_RX_EN_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.RX_EN */
#define IFX_P_LPCR2_RX_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.RX_EN */
#define IFX_P_LPCR2_RX_EN_OFF        (1)

/** \\brief  Length for Ifx_P_LPCR2_Bits.TEN_CTRL */
#define IFX_P_LPCR2_TEN_CTRL_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.TEN_CTRL */
#define IFX_P_LPCR2_TEN_CTRL_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.TEN_CTRL */
#define IFX_P_LPCR2_TEN_CTRL_OFF     (8)

/** \\brief  Length for Ifx_P_LPCR2_Bits.TERM */
#define IFX_P_LPCR2_TERM_LEN         (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.TERM */
#define IFX_P_LPCR2_TERM_MSK         (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.TERM */
#define IFX_P_LPCR2_TERM_OFF         (2)

/** \\brief  Length for Ifx_P_LPCR2_Bits.TX_EN */
#define IFX_P_LPCR2_TX_EN_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.TX_EN */
#define IFX_P_LPCR2_TX_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.TX_EN */
#define IFX_P_LPCR2_TX_EN_OFF        (9)

/** \\brief  Length for Ifx_P_LPCR2_Bits.TX_PD */
#define IFX_P_LPCR2_TX_PD_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.TX_PD */
#define IFX_P_LPCR2_TX_PD_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.TX_PD */
#define IFX_P_LPCR2_TX_PD_OFF        (14)

/** \\brief  Length for Ifx_P_LPCR2_Bits.TX_PWDPD */
#define IFX_P_LPCR2_TX_PWDPD_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.TX_PWDPD */
#define IFX_P_LPCR2_TX_PWDPD_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.TX_PWDPD */
#define IFX_P_LPCR2_TX_PWDPD_OFF     (15)

/** \\brief  Length for Ifx_P_LPCR2_Bits.VDIFFADJ */
#define IFX_P_LPCR2_VDIFFADJ_LEN     (2)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.VDIFFADJ */
#define IFX_P_LPCR2_VDIFFADJ_MSK     (0x3)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.VDIFFADJ */
#define IFX_P_LPCR2_VDIFFADJ_OFF     (10)

/** \\brief  Length for Ifx_P_LPCR2_Bits.VOSDYN */
#define IFX_P_LPCR2_VOSDYN_LEN       (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.VOSDYN */
#define IFX_P_LPCR2_VOSDYN_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.VOSDYN */
#define IFX_P_LPCR2_VOSDYN_OFF       (12)

/** \\brief  Length for Ifx_P_LPCR2_Bits.VOSEXT */
#define IFX_P_LPCR2_VOSEXT_LEN       (1)

/** \\brief  Mask for Ifx_P_LPCR2_Bits.VOSEXT */
#define IFX_P_LPCR2_VOSEXT_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR2_Bits.VOSEXT */
#define IFX_P_LPCR2_VOSEXT_OFF       (13)

/** \\brief  Length for Ifx_P_LPCR3_Bits.LRXTERM */
#define IFX_P_LPCR3_LRXTERM_LEN      (3)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.LRXTERM */
#define IFX_P_LPCR3_LRXTERM_MSK      (0x7)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.LRXTERM */
#define IFX_P_LPCR3_LRXTERM_OFF      (3)

/** \\brief  Length for Ifx_P_LPCR3_Bits.LVDSM */
#define IFX_P_LPCR3_LVDSM_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.LVDSM */
#define IFX_P_LPCR3_LVDSM_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.LVDSM */
#define IFX_P_LPCR3_LVDSM_OFF        (6)

/** \\brief  Length for Ifx_P_LPCR3_Bits.PS */
#define IFX_P_LPCR3_PS_LEN           (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.PS */
#define IFX_P_LPCR3_PS_MSK           (0x1)

