Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_bf.h
/** \\brief  Offset for Ifx_P_LPCR3_Bits.PS */
#define IFX_P_LPCR3_PS_OFF           (7)

/** \\brief  Length for Ifx_P_LPCR3_Bits.REN_CTRL */
#define IFX_P_LPCR3_REN_CTRL_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.REN_CTRL */
#define IFX_P_LPCR3_REN_CTRL_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.REN_CTRL */
#define IFX_P_LPCR3_REN_CTRL_OFF     (0)

/** \\brief  Length for Ifx_P_LPCR3_Bits.RX_EN */
#define IFX_P_LPCR3_RX_EN_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.RX_EN */
#define IFX_P_LPCR3_RX_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.RX_EN */
#define IFX_P_LPCR3_RX_EN_OFF        (1)

/** \\brief  Length for Ifx_P_LPCR3_Bits.TEN_CTRL */
#define IFX_P_LPCR3_TEN_CTRL_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.TEN_CTRL */
#define IFX_P_LPCR3_TEN_CTRL_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.TEN_CTRL */
#define IFX_P_LPCR3_TEN_CTRL_OFF     (8)

/** \\brief  Length for Ifx_P_LPCR3_Bits.TERM */
#define IFX_P_LPCR3_TERM_LEN         (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.TERM */
#define IFX_P_LPCR3_TERM_MSK         (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.TERM */
#define IFX_P_LPCR3_TERM_OFF         (2)

/** \\brief  Length for Ifx_P_LPCR3_Bits.TX_EN */
#define IFX_P_LPCR3_TX_EN_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.TX_EN */
#define IFX_P_LPCR3_TX_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.TX_EN */
#define IFX_P_LPCR3_TX_EN_OFF        (9)

/** \\brief  Length for Ifx_P_LPCR3_Bits.TX_PD */
#define IFX_P_LPCR3_TX_PD_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.TX_PD */
#define IFX_P_LPCR3_TX_PD_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.TX_PD */
#define IFX_P_LPCR3_TX_PD_OFF        (14)

/** \\brief  Length for Ifx_P_LPCR3_Bits.TX_PWDPD */
#define IFX_P_LPCR3_TX_PWDPD_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.TX_PWDPD */
#define IFX_P_LPCR3_TX_PWDPD_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.TX_PWDPD */
#define IFX_P_LPCR3_TX_PWDPD_OFF     (15)

/** \\brief  Length for Ifx_P_LPCR3_Bits.VDIFFADJ */
#define IFX_P_LPCR3_VDIFFADJ_LEN     (2)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.VDIFFADJ */
#define IFX_P_LPCR3_VDIFFADJ_MSK     (0x3)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.VDIFFADJ */
#define IFX_P_LPCR3_VDIFFADJ_OFF     (10)

/** \\brief  Length for Ifx_P_LPCR3_Bits.VOSDYN */
#define IFX_P_LPCR3_VOSDYN_LEN       (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.VOSDYN */
#define IFX_P_LPCR3_VOSDYN_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.VOSDYN */
#define IFX_P_LPCR3_VOSDYN_OFF       (12)

/** \\brief  Length for Ifx_P_LPCR3_Bits.VOSEXT */
#define IFX_P_LPCR3_VOSEXT_LEN       (1)

/** \\brief  Mask for Ifx_P_LPCR3_Bits.VOSEXT */
#define IFX_P_LPCR3_VOSEXT_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR3_Bits.VOSEXT */
#define IFX_P_LPCR3_VOSEXT_OFF       (13)

/** \\brief  Length for Ifx_P_LPCR5_Bits.LRXTERM */
#define IFX_P_LPCR5_LRXTERM_LEN      (3)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.LRXTERM */
#define IFX_P_LPCR5_LRXTERM_MSK      (0x7)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.LRXTERM */
#define IFX_P_LPCR5_LRXTERM_OFF      (3)

/** \\brief  Length for Ifx_P_LPCR5_Bits.LVDSM */
#define IFX_P_LPCR5_LVDSM_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.LVDSM */
#define IFX_P_LPCR5_LVDSM_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.LVDSM */
#define IFX_P_LPCR5_LVDSM_OFF        (6)

/** \\brief  Length for Ifx_P_LPCR5_Bits.PS */
#define IFX_P_LPCR5_PS_LEN           (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.PS */
#define IFX_P_LPCR5_PS_MSK           (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.PS */
#define IFX_P_LPCR5_PS_OFF           (7)

/** \\brief  Length for Ifx_P_LPCR5_Bits.REN_CTRL */
#define IFX_P_LPCR5_REN_CTRL_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.REN_CTRL */
#define IFX_P_LPCR5_REN_CTRL_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.REN_CTRL */
#define IFX_P_LPCR5_REN_CTRL_OFF     (0)

/** \\brief  Length for Ifx_P_LPCR5_Bits.RX_EN */
#define IFX_P_LPCR5_RX_EN_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.RX_EN */
#define IFX_P_LPCR5_RX_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.RX_EN */
#define IFX_P_LPCR5_RX_EN_OFF        (1)

/** \\brief  Length for Ifx_P_LPCR5_Bits.TEN_CTRL */
#define IFX_P_LPCR5_TEN_CTRL_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.TEN_CTRL */
#define IFX_P_LPCR5_TEN_CTRL_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.TEN_CTRL */
#define IFX_P_LPCR5_TEN_CTRL_OFF     (8)

/** \\brief  Length for Ifx_P_LPCR5_Bits.TERM */
#define IFX_P_LPCR5_TERM_LEN         (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.TERM */
#define IFX_P_LPCR5_TERM_MSK         (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.TERM */
#define IFX_P_LPCR5_TERM_OFF         (2)

/** \\brief  Length for Ifx_P_LPCR5_Bits.TX_EN */
#define IFX_P_LPCR5_TX_EN_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.TX_EN */
#define IFX_P_LPCR5_TX_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.TX_EN */
#define IFX_P_LPCR5_TX_EN_OFF        (9)

/** \\brief  Length for Ifx_P_LPCR5_Bits.TX_PD */
#define IFX_P_LPCR5_TX_PD_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.TX_PD */
#define IFX_P_LPCR5_TX_PD_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.TX_PD */
#define IFX_P_LPCR5_TX_PD_OFF        (14)

/** \\brief  Length for Ifx_P_LPCR5_Bits.TX_PWDPD */
#define IFX_P_LPCR5_TX_PWDPD_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.TX_PWDPD */
#define IFX_P_LPCR5_TX_PWDPD_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.TX_PWDPD */
#define IFX_P_LPCR5_TX_PWDPD_OFF     (15)

/** \\brief  Length for Ifx_P_LPCR5_Bits.VDIFFADJ */
#define IFX_P_LPCR5_VDIFFADJ_LEN     (2)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.VDIFFADJ */
#define IFX_P_LPCR5_VDIFFADJ_MSK     (0x3)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.VDIFFADJ */
#define IFX_P_LPCR5_VDIFFADJ_OFF     (10)

/** \\brief  Length for Ifx_P_LPCR5_Bits.VOSDYN */
#define IFX_P_LPCR5_VOSDYN_LEN       (1)

/** \\brief  Mask for Ifx_P_LPCR5_Bits.VOSDYN */
#define IFX_P_LPCR5_VOSDYN_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.VOSDYN */
#define IFX_P_LPCR5_VOSDYN_OFF       (12)

/** \\brief  Length for Ifx_P_LPCR5_Bits.VOSEXT */
#define IFX_P_LPCR5_VOSEXT_LEN       (1)

