Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_bf.h
/** \\brief  Mask for Ifx_P_LPCR5_Bits.VOSEXT */
#define IFX_P_LPCR5_VOSEXT_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR5_Bits.VOSEXT */
#define IFX_P_LPCR5_VOSEXT_OFF       (13)

/** \\brief  Length for Ifx_P_LPCR6_Bits.PS */
#define IFX_P_LPCR6_PS_LEN           (1)

/** \\brief  Mask for Ifx_P_LPCR6_Bits.PS */
#define IFX_P_LPCR6_PS_MSK           (0x1)

/** \\brief  Offset for Ifx_P_LPCR6_Bits.PS */
#define IFX_P_LPCR6_PS_OFF           (7)

/** \\brief  Length for Ifx_P_LPCR6_Bits.TEN_CTRL */
#define IFX_P_LPCR6_TEN_CTRL_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR6_Bits.TEN_CTRL */
#define IFX_P_LPCR6_TEN_CTRL_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR6_Bits.TEN_CTRL */
#define IFX_P_LPCR6_TEN_CTRL_OFF     (8)

/** \\brief  Length for Ifx_P_LPCR6_Bits.TX_EN */
#define IFX_P_LPCR6_TX_EN_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR6_Bits.TX_EN */
#define IFX_P_LPCR6_TX_EN_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR6_Bits.TX_EN */
#define IFX_P_LPCR6_TX_EN_OFF        (9)

/** \\brief  Length for Ifx_P_LPCR6_Bits.TX_PD */
#define IFX_P_LPCR6_TX_PD_LEN        (1)

/** \\brief  Mask for Ifx_P_LPCR6_Bits.TX_PD */
#define IFX_P_LPCR6_TX_PD_MSK        (0x1)

/** \\brief  Offset for Ifx_P_LPCR6_Bits.TX_PD */
#define IFX_P_LPCR6_TX_PD_OFF        (14)

/** \\brief  Length for Ifx_P_LPCR6_Bits.TX_PWDPD */
#define IFX_P_LPCR6_TX_PWDPD_LEN     (1)

/** \\brief  Mask for Ifx_P_LPCR6_Bits.TX_PWDPD */
#define IFX_P_LPCR6_TX_PWDPD_MSK     (0x1)

/** \\brief  Offset for Ifx_P_LPCR6_Bits.TX_PWDPD */
#define IFX_P_LPCR6_TX_PWDPD_OFF     (15)

/** \\brief  Length for Ifx_P_LPCR6_Bits.VDIFFADJ */
#define IFX_P_LPCR6_VDIFFADJ_LEN     (2)

/** \\brief  Mask for Ifx_P_LPCR6_Bits.VDIFFADJ */
#define IFX_P_LPCR6_VDIFFADJ_MSK     (0x3)

/** \\brief  Offset for Ifx_P_LPCR6_Bits.VDIFFADJ */
#define IFX_P_LPCR6_VDIFFADJ_OFF     (10)

/** \\brief  Length for Ifx_P_LPCR6_Bits.VOSDYN */
#define IFX_P_LPCR6_VOSDYN_LEN       (1)

/** \\brief  Mask for Ifx_P_LPCR6_Bits.VOSDYN */
#define IFX_P_LPCR6_VOSDYN_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR6_Bits.VOSDYN */
#define IFX_P_LPCR6_VOSDYN_OFF       (12)

/** \\brief  Length for Ifx_P_LPCR6_Bits.VOSEXT */
#define IFX_P_LPCR6_VOSEXT_LEN       (1)

/** \\brief  Mask for Ifx_P_LPCR6_Bits.VOSEXT */
#define IFX_P_LPCR6_VOSEXT_MSK       (0x1)

/** \\brief  Offset for Ifx_P_LPCR6_Bits.VOSEXT */
#define IFX_P_LPCR6_VOSEXT_OFF       (13)

/** \\brief  Length for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_LEN         (1)

/** \\brief  Mask for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_MSK         (0x1)

/** \\brief  Offset for Ifx_P_OMCR0_Bits.PCL0 */
#define IFX_P_OMCR0_PCL0_OFF         (16)

/** \\brief  Length for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_LEN         (1)

/** \\brief  Mask for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_MSK         (0x1)

/** \\brief  Offset for Ifx_P_OMCR0_Bits.PCL1 */
#define IFX_P_OMCR0_PCL1_OFF         (17)

/** \\brief  Length for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_LEN         (1)

/** \\brief  Mask for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_MSK         (0x1)

/** \\brief  Offset for Ifx_P_OMCR0_Bits.PCL2 */
#define IFX_P_OMCR0_PCL2_OFF         (18)

/** \\brief  Length for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_LEN         (1)

/** \\brief  Mask for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_MSK         (0x1)

/** \\brief  Offset for Ifx_P_OMCR0_Bits.PCL3 */
#define IFX_P_OMCR0_PCL3_OFF         (19)

/** \\brief  Length for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_LEN       (1)

/** \\brief  Mask for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_MSK       (0x1)

/** \\brief  Offset for Ifx_P_OMCR12_Bits.PCL12 */
#define IFX_P_OMCR12_PCL12_OFF       (28)

/** \\brief  Length for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_LEN       (1)

/** \\brief  Mask for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_MSK       (0x1)

/** \\brief  Offset for Ifx_P_OMCR12_Bits.PCL13 */
#define IFX_P_OMCR12_PCL13_OFF       (29)

/** \\brief  Length for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_LEN       (1)

/** \\brief  Mask for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_MSK       (0x1)

/** \\brief  Offset for Ifx_P_OMCR12_Bits.PCL14 */
#define IFX_P_OMCR12_PCL14_OFF       (30)

/** \\brief  Length for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_LEN       (1)

/** \\brief  Mask for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_MSK       (0x1)

/** \\brief  Offset for Ifx_P_OMCR12_Bits.PCL15 */
#define IFX_P_OMCR12_PCL15_OFF       (31)

/** \\brief  Length for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_LEN         (1)

/** \\brief  Mask for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_MSK         (0x1)

/** \\brief  Offset for Ifx_P_OMCR4_Bits.PCL4 */
#define IFX_P_OMCR4_PCL4_OFF         (20)

/** \\brief  Length for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_LEN         (1)

/** \\brief  Mask for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_MSK         (0x1)

/** \\brief  Offset for Ifx_P_OMCR4_Bits.PCL5 */
#define IFX_P_OMCR4_PCL5_OFF         (21)

/** \\brief  Length for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_LEN         (1)

/** \\brief  Mask for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_MSK         (0x1)

/** \\brief  Offset for Ifx_P_OMCR4_Bits.PCL6 */
#define IFX_P_OMCR4_PCL6_OFF         (22)

/** \\brief  Length for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_LEN         (1)

/** \\brief  Mask for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_MSK         (0x1)

/** \\brief  Offset for Ifx_P_OMCR4_Bits.PCL7 */
#define IFX_P_OMCR4_PCL7_OFF         (23)

/** \\brief  Length for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_LEN        (1)

/** \\brief  Mask for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_MSK        (0x1)

/** \\brief  Offset for Ifx_P_OMCR8_Bits.PCL10 */
#define IFX_P_OMCR8_PCL10_OFF        (26)

