Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_bf.h
/** \\brief  Length for Ifx_P_OUT_Bits.P2 */
#define IFX_P_OUT_P2_LEN             (1)

/** \\brief  Mask for Ifx_P_OUT_Bits.P2 */
#define IFX_P_OUT_P2_MSK             (0x1)

/** \\brief  Offset for Ifx_P_OUT_Bits.P2 */
#define IFX_P_OUT_P2_OFF             (2)

/** \\brief  Length for Ifx_P_OUT_Bits.P3 */
#define IFX_P_OUT_P3_LEN             (1)

/** \\brief  Mask for Ifx_P_OUT_Bits.P3 */
#define IFX_P_OUT_P3_MSK             (0x1)

/** \\brief  Offset for Ifx_P_OUT_Bits.P3 */
#define IFX_P_OUT_P3_OFF             (3)

/** \\brief  Length for Ifx_P_OUT_Bits.P4 */
#define IFX_P_OUT_P4_LEN             (1)

/** \\brief  Mask for Ifx_P_OUT_Bits.P4 */
#define IFX_P_OUT_P4_MSK             (0x1)

/** \\brief  Offset for Ifx_P_OUT_Bits.P4 */
#define IFX_P_OUT_P4_OFF             (4)

/** \\brief  Length for Ifx_P_OUT_Bits.P5 */
#define IFX_P_OUT_P5_LEN             (1)

/** \\brief  Mask for Ifx_P_OUT_Bits.P5 */
#define IFX_P_OUT_P5_MSK             (0x1)

/** \\brief  Offset for Ifx_P_OUT_Bits.P5 */
#define IFX_P_OUT_P5_OFF             (5)

/** \\brief  Length for Ifx_P_OUT_Bits.P6 */
#define IFX_P_OUT_P6_LEN             (1)

/** \\brief  Mask for Ifx_P_OUT_Bits.P6 */
#define IFX_P_OUT_P6_MSK             (0x1)

/** \\brief  Offset for Ifx_P_OUT_Bits.P6 */
#define IFX_P_OUT_P6_OFF             (6)

/** \\brief  Length for Ifx_P_OUT_Bits.P7 */
#define IFX_P_OUT_P7_LEN             (1)

/** \\brief  Mask for Ifx_P_OUT_Bits.P7 */
#define IFX_P_OUT_P7_MSK             (0x1)

/** \\brief  Offset for Ifx_P_OUT_Bits.P7 */
#define IFX_P_OUT_P7_OFF             (7)

/** \\brief  Length for Ifx_P_OUT_Bits.P8 */
#define IFX_P_OUT_P8_LEN             (1)

/** \\brief  Mask for Ifx_P_OUT_Bits.P8 */
#define IFX_P_OUT_P8_MSK             (0x1)

/** \\brief  Offset for Ifx_P_OUT_Bits.P8 */
#define IFX_P_OUT_P8_OFF             (8)

/** \\brief  Length for Ifx_P_OUT_Bits.P9 */
#define IFX_P_OUT_P9_LEN             (1)

/** \\brief  Mask for Ifx_P_OUT_Bits.P9 */
#define IFX_P_OUT_P9_MSK             (0x1)

/** \\brief  Offset for Ifx_P_OUT_Bits.P9 */
#define IFX_P_OUT_P9_OFF             (9)

/** \\brief  Length for Ifx_P_PCSR_Bits.LCK */
#define IFX_P_PCSR_LCK_LEN           (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.LCK */
#define IFX_P_PCSR_LCK_MSK           (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.LCK */
#define IFX_P_PCSR_LCK_OFF           (31)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL0 */
#define IFX_P_PCSR_SEL0_LEN          (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL0 */
#define IFX_P_PCSR_SEL0_MSK          (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL0 */
#define IFX_P_PCSR_SEL0_OFF          (0)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL10 */
#define IFX_P_PCSR_SEL10_LEN         (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL10 */
#define IFX_P_PCSR_SEL10_MSK         (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL10 */
#define IFX_P_PCSR_SEL10_OFF         (10)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL11 */
#define IFX_P_PCSR_SEL11_LEN         (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL11 */
#define IFX_P_PCSR_SEL11_MSK         (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL11 */
#define IFX_P_PCSR_SEL11_OFF         (11)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL12 */
#define IFX_P_PCSR_SEL12_LEN         (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL12 */
#define IFX_P_PCSR_SEL12_MSK         (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL12 */
#define IFX_P_PCSR_SEL12_OFF         (12)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL13 */
#define IFX_P_PCSR_SEL13_LEN         (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL13 */
#define IFX_P_PCSR_SEL13_MSK         (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL13 */
#define IFX_P_PCSR_SEL13_OFF         (13)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL14 */
#define IFX_P_PCSR_SEL14_LEN         (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL14 */
#define IFX_P_PCSR_SEL14_MSK         (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL14 */
#define IFX_P_PCSR_SEL14_OFF         (14)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL15 */
#define IFX_P_PCSR_SEL15_LEN         (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL15 */
#define IFX_P_PCSR_SEL15_MSK         (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL15 */
#define IFX_P_PCSR_SEL15_OFF         (15)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_LEN          (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_MSK          (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_OFF          (1)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_LEN          (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_MSK          (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_OFF          (2)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL3 */
#define IFX_P_PCSR_SEL3_LEN          (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL3 */
#define IFX_P_PCSR_SEL3_MSK          (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL3 */
#define IFX_P_PCSR_SEL3_OFF          (3)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL4 */
#define IFX_P_PCSR_SEL4_LEN          (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL4 */
#define IFX_P_PCSR_SEL4_MSK          (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL4 */
#define IFX_P_PCSR_SEL4_OFF          (4)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL5 */
#define IFX_P_PCSR_SEL5_LEN          (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL5 */
#define IFX_P_PCSR_SEL5_MSK          (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL5 */
#define IFX_P_PCSR_SEL5_OFF          (5)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL6 */
#define IFX_P_PCSR_SEL6_LEN          (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL6 */
#define IFX_P_PCSR_SEL6_MSK          (0x1)

/** \\brief  Offset for Ifx_P_PCSR_Bits.SEL6 */
#define IFX_P_PCSR_SEL6_OFF          (6)

/** \\brief  Length for Ifx_P_PCSR_Bits.SEL7 */
#define IFX_P_PCSR_SEL7_LEN          (1)

/** \\brief  Mask for Ifx_P_PCSR_Bits.SEL7 */
#define IFX_P_PCSR_SEL7_MSK          (0x1)

